
Your task is to determine if a given Python program is correct based on the provided problem description and its execution summary. You can use the execution summary as a guide to understand the program’s behavior. Assume valid inputs as described in the problem description.

First explain your reasoning  then reply Correctness: **True**  if the given program is correct or Correctness: **False**  if the given program is incorrect.

# Problem:
Карта звёздного неба представляет собой прямоугольное поле, состоящее из n строк по m символов в каждой строке. Каждый символ — это либо «.» (означает пустой участок неба), либо «*» (означает то, что в этом месте на небе есть звезда). 

Новое издание карты звёздного неба будет напечатано на квадратных листах, поэтому требуется найти минимально возможную сторону квадрата, в который могут поместиться все звезды. Границы искомого квадрата должны быть параллельны сторонам заданного прямоугольного поля.


-----Входные данные-----

В первой строке входных данных записаны два числа n и m (1 ≤ n, m ≤ 1000) — количество строк и столбцов на карте звездного неба.

В следующих n строках задано по m символов. Каждый символ — это либо «.» (пустой участок неба), либо «*» (звезда).

Гарантируется, что на небе есть хотя бы одна звезда.


-----Выходные данные-----

Выведите одно число — минимально возможную сторону квадрата, которым можно накрыть все звезды.


-----Примеры-----
Входные данные
4 4
....
..*.
...*
..**

Выходные данные
3

Входные данные
1 3
*.*

Выходные данные
3

Входные данные
2 1
.
*

Выходные данные
1



-----Примечание-----

Один из возможных ответов на первый тестовый пример:

 [Image] 

Один из возможных ответов на второй тестовый пример (обратите внимание, что покрывающий квадрат выходит за пределы карты звездного неба):

 [Image] 

Ответ на третий тестовый пример:

 [Image]

# Program:
def func():
    (n, m) = map(int, input().split())
    stars = []
    for _ in range(n):
        row = input()
        for (j, c) in enumerate(row):
            if c == '*':
                stars.append((j, _))
    min_x = min((x for (x, y) in stars))
    max_x = max((x for (x, y) in stars))
    min_y = min((y for (x, y) in stars))
    max_y = max((y for (x, y) in stars))
    side = max(max_x - min_x + 1, max_y - min_y + 1)
    print(side)





# Execution Summary:
The function processes a star map represented as a 2D list where each element is either '.' or '*', indicating empty space or a star respectively. It reads the dimensions of the star map from user input, constructs a list of coordinates for all stars found in the map, and then calculates the side length of the smallest square that can contain all the stars. If no stars are found, the function returns a side length of 1. The function does not modify the original input but rather uses the input to derive the required output.


# Your response:
Reasoning:  
Correctness: **True** or **False**

