
Your task is to determine if a given Python program is correct based on the problem description and the execution states of the program provided as comments. Assume valid inputs as described in the problem description.

First explain your reasoning  then reply Correctness: **True**  if the given program is correct or Correctness: **False**  if the given program is incorrect.


# Problem:
В Берляндском государственном университете локальная сеть между серверами не всегда работает без ошибок. При передаче двух одинаковых сообщений подряд возможна ошибка, в результате которой эти два сообщения сливаются в одно. При таком слиянии конец первого сообщения совмещается с началом второго. Конечно, совмещение может происходить только по одинаковым символам. Длина совмещения должна быть положительным числом, меньшим длины текста сообщения. 

Например, при передаче двух сообщений «abrakadabra» подряд возможно, что оно будет передано с ошибкой описанного вида, и тогда будет получено сообщение вида «abrakadabrabrakadabra» или «abrakadabrakadabra» (в первом случае совмещение произошло по одному символу, а во втором — по четырем).

По полученному сообщению t определите, возможно ли, что это результат ошибки описанного вида работы локальной сети, и если возможно, определите возможное значение s. 

Не следует считать ошибкой ситуацию полного наложения друга на друга двух сообщений. К примеру, если получено сообщение «abcd», следует считать, что в нём ошибки нет. Аналогично, простое дописывание одного сообщения вслед за другим не является признаком ошибки. Например, если получено сообщение «abcabc», следует считать, что в нём ошибки нет.


-----Входные данные-----

В единственной строке выходных данных следует непустая строка t, состоящая из строчных букв латинского алфавита. Длина строки t не превосходит 100 символов.


-----Выходные данные-----

Если сообщение t не может содержать ошибки, выведите «NO» (без кавычек) в единственную строку выходных данных.

В противном случае в первой строке выведите «YES» (без кавычек), а в следующей строке выведите строку s — возможное сообщение, которое могло привести к ошибке. Если возможных ответов несколько, разрешается вывести любой из них.


-----Примеры-----
Входные данные
abrakadabrabrakadabra

Выходные данные
YES
abrakadabra

Входные данные
acacacaca

Выходные данные
YES
acaca

Входные данные
abcabc

Выходные данные
NO

Входные данные
abababab

Выходные данные
YES
ababab

Входные данные
tatbt

Выходные данные
NO



-----Примечание-----

Во втором примере подходящим ответом также является строка acacaca.

# Annotated Program:
t = input().strip()
print(func_1(t))

#State of the program right berfore the function call: t is a non-empty string consisting of lowercase Latin letters, and the length of the string does not exceed 100 characters.
def func_1(t):
    n = len(t)
    for i in range(1, n):
        if t[:i] == t[-i:]:
            s = t[:-i]
            if s + t[-i:] == t:
                return 'YES\n' + s
        
    #State of the program after the  for loop has been executed: Output State: The string `t` remains unchanged, `n` is the length of `t`, and `i` reaches the value of `n`. The function will return 'YES\n' followed by a substring of `t` if there exists an index `i` such that `t[:i]` is equal to `t[-i:]` for all iterations up to `n-1`. If no such index is found, the function will return nothing (i.e., it will exit without returning any value).
    #
    #To summarize:
    #- **Invariant Variables**: `t`, `n`.
    #- **Final Values**: `i` equals `n`.
    #- **Loop Behavior**: The loop iterates from `1` to `n-1`. During each iteration, it checks if the prefix of `t` of length `i` is equal to the suffix of `t` of length `i`. If this condition is met, the function returns 'YES\n' followed by the substring `t[:-i]` and stops. If the condition is not met for any `i`, the function exits without returning anything.
    #
    #Therefore, the final output state is:
    #Output State: `t` is a non-empty string consisting of lowercase Latin letters, `n` is the length of `t`, and `i` is `n`. The function will return 'YES\n' followed by a substring of `t` if there exists an index `i` such that `t[:i]` is equal to `t[-i:]` for all iterations up to `n-1`. Otherwise, the function returns nothing.
    return 'NO'
    #The program returns 'NO'


# Your response:
Reasoning:  
Correctness: **True** or **False**

