
Your task is to determine if a given Python program is correct based on the provided problem description and its execution summary. You can use the execution summary as a guide to understand the program’s behavior. Assume valid inputs as described in the problem description.

First explain your reasoning  then reply Correctness: **True**  if the given program is correct or Correctness: **False**  if the given program is incorrect.

# Problem:
В Берляндском государственном университете локальная сеть между серверами не всегда работает без ошибок. При передаче двух одинаковых сообщений подряд возможна ошибка, в результате которой эти два сообщения сливаются в одно. При таком слиянии конец первого сообщения совмещается с началом второго. Конечно, совмещение может происходить только по одинаковым символам. Длина совмещения должна быть положительным числом, меньшим длины текста сообщения. 

Например, при передаче двух сообщений «abrakadabra» подряд возможно, что оно будет передано с ошибкой описанного вида, и тогда будет получено сообщение вида «abrakadabrabrakadabra» или «abrakadabrakadabra» (в первом случае совмещение произошло по одному символу, а во втором — по четырем).

По полученному сообщению t определите, возможно ли, что это результат ошибки описанного вида работы локальной сети, и если возможно, определите возможное значение s. 

Не следует считать ошибкой ситуацию полного наложения друга на друга двух сообщений. К примеру, если получено сообщение «abcd», следует считать, что в нём ошибки нет. Аналогично, простое дописывание одного сообщения вслед за другим не является признаком ошибки. Например, если получено сообщение «abcabc», следует считать, что в нём ошибки нет.


-----Входные данные-----

В единственной строке выходных данных следует непустая строка t, состоящая из строчных букв латинского алфавита. Длина строки t не превосходит 100 символов.


-----Выходные данные-----

Если сообщение t не может содержать ошибки, выведите «NO» (без кавычек) в единственную строку выходных данных.

В противном случае в первой строке выведите «YES» (без кавычек), а в следующей строке выведите строку s — возможное сообщение, которое могло привести к ошибке. Если возможных ответов несколько, разрешается вывести любой из них.


-----Примеры-----
Входные данные
abrakadabrabrakadabra

Выходные данные
YES
abrakadabra

Входные данные
acacacaca

Выходные данные
YES
acaca

Входные данные
abcabc

Выходные данные
NO

Входные данные
abababab

Выходные данные
YES
ababab

Входные данные
tatbt

Выходные данные
NO



-----Примечание-----

Во втором примере подходящим ответом также является строка acacaca.

# Program:
t = input().strip()
print(func_1(t))

def func_1(t):
    n = len(t)
    for i in range(1, n):
        if t[:i] == t[-i:]:
            s = t[:-i]
            if s + t[-i:] == t:
                return 'YES\n' + s
    return 'NO'





# Execution Summary:
The function `func_1` accepts a non-empty string `t` consisting of lowercase Latin letters with a maximum length of 100 characters. It checks for the existence of a suffix within the string `t` that matches a prefix of the same length. If such a suffix is found, the function returns 'YES' followed by the substring of `t` from the start to the position just before the matched suffix. If no matching suffix is found, the function returns 'NO'. Specifically:

- If `t[:i]` is equal to `t[-i:]` for any `i` in the range `1` to `n-1`, where `n` is the length of `t`, the function returns 'YES' followed by the substring `t[:-i]`.
- If no such `i` is found, the function returns 'NO'.

The function does not modify the original string `t`. The final state of the program after the function concludes will be:
- If the function returns 'YES', the returned string is a substring of `t` from the start to the position just before the first matching suffix.
- If the function returns 'NO', the program simply returns 'NO' without any further action on `t`.

Potential edge cases include strings of varying lengths and content, ensuring that the function behaves correctly for all valid inputs.


# Your response:
Reasoning:  
Correctness: **True** or **False**

